using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _3._19_11.Classes
{
    // Создать класс, производный от базового класса .
    class DescedantClass:BaseClass
    {
        public DescedantClass()
        {
            Console.WriteLine("Конструирование класса DescedantClass.");
        }
    }
}
